{
    "Home": "Home",
    "Career": "Career",
    "Contact": "Contact",
    "Skills": "Skills",
    "Curriculum vitae": "Curriculum vitae",
    "heyText": "Hey, I'm Gabriel.",
    "dramaticPhrase": "And I love helping people through code.",
    "presentationParagraph1": "I'm a dedicated data engineer and consultant who can help you achieve your company goals.",
    "presentationParagraph2": "While having extensive experience with both frontend and backend solutions - by building fullstack web applications - I repeatedly found myself drawn to the intricacies of backend development.",
    "presentationParagraph3": "My biggest tech passion is working with data - extracting, transforming, and harnessing its potential from many different sources to create meaningful value.",
    "techsExperience": "Here are some of the main technologies I'm experienced with",
    "lumenalta-dataEngineer-part1": "Maintaining and building ETL pipelines using Airflow, PostgreSQL, Databricks, Snowflake, AWS Redshift, AWS S3, AWS Lambda, and other AWS tools.",
    "lumenalta-dataEngineer-part2": "Refactored nearly the entire project codebase, resulting in substantial improvements.",
    "lumenalta-dataEngineer-part3": "Reduced database storage utilization by up to 50% and dramatically accelerated crucial data pipelines.",
    "lumenalta-dataEngineer-part4": "Streamlined operations by automating and optimizing manual tasks such as email dispatch and report generation.",
    "lumenalta-dataEngineer-part5": "Centralized the client's ETL architecture, consolidating dispersed processes into a single, easily managed framework.",
    "lumenalta-pythonDeveloper-part1": "Development of serverless applications using Chalice, Terraform, and other AWS technologies (SNS, SES, and DynamoDB).",
    "lumenalta-pythonDeveloper-part2": "Reverse engineering on web SAAS applications.",
    "lumenalta-pythonDeveloper-part3": "Integrating new partners into the client platform.",
    "lumenalta-javascriptFullstackDeveloper-part1": "Development of web applications using NodeJS, ReactJS and MongoDB.",
    "lumenalta-javascriptFullstackDeveloper-part2": "Brief experience with adapting client software to conform with Web Accessibility Guidelines (WCAG/ADA).",
    "develcode-techLead-part1": "Technical leader of a project integration development using SpringBoot and ReactJS.",
    "develcode-fullStackDeveloper-part1": "Created frontend applications with JavaScript and TypeScript (ReactJS), utilizing HTML and CSS3.",
    "develcode-fullStackDeveloper-part2": "Developed backend applications using Java (SpringBoot), along with managing databases in PostgreSQL and MySQL.",
    "develcode-fullStackDeveloper-part3": "Conducted maintenance tasks on a native Android mobile app.",
    "concordia-fullStackDeveloper-part1": "Built web apps using Django (Python), HTML, CSS, JavaScript, and TypeScript, and also dabbled in ReactJS, NodeJS, Angular, and NestJS.",
    "concordia-fullStackDeveloper-part2": "Had a hand in making hybrid mobile apps with ReactNative and Ionic Cordova.",
    "concordia-fullStackDeveloper-part3": "Recreated a legacy platform by moving it to the web with newer tech, making it more user-friendly.",
    "concordia-fullStackDeveloper-part4": "Got good at moving data between different systems and formats for clients.",
    "dipsystem-fullStackDeveloper-part1": "Helped to port a legacy tracking system to a new version written from scratch and using newer technology.",
    "dipsystem-fullStackDeveloper-part2": "Worked on web applications using HTML, CSS3, JavaScript and TypeScript, NodeJS, Python (Django, Tornado), MySQL, Angular and MongoDB.",
    "reachMeOutText": "If you want to talk about career opportunities, discuss about leveling up professionally, or just do some networking, I'm all ears! Don't hesitate to reach out - I'm here to connect, collaborate, and share ideas with like-minded people."
    
}