{
    "Home": "Home",
    "Career": "Career",
    "Contact": "Contact",
    "Skills": "Skills",
    "Curriculum vitae": "Curriculum vitae",
  
    "heyText": "Hey, I'm Gabriel.",
    "dramaticPhrase": "I like when things break - because that's when you learn what holds them together.",
  
    "presentationParagraph": "I'm the kind of person who takes things apart just to see how they work - and sometimes, to figure out why they <i>don't</i>.<br><br>I love writing code, but what really keeps me engaged is the bigger picture - building with intention and thinking beyond the code, communicating clearly, and making sure everyone on a team knows what they're doing (and <i>why</i>).<br><br>I believe good engineering is as much about people as it is about tech, and that the best solutions are the ones that actually make someone's day easier.",
  
    "curriculumPresentationParagraph": "I'm an engineer who thrives on building systems that make sense - technically and practically. I've worked across frontend, backend and infrastructure, using various tools and technologies to create solid, scalable solutions. To me, good engineering is about more than code - it's about clear thinking, strong collaboration, and solving the right problems. I believe that alignment beats assumptions every time.<br>I'm focused on growing not just as a developer, but as someone who helps teams move with clarity and confidence.",
  
    "testbox-leadEngineer-description": "Lead engineer responsible for driving the technical direction of the integrations team.<br>Built and scaled backend infrastructure in Python and AWS (Terraform, Lambda, CircleCI) to support client-facing integrations.<br>Made architecture and design decisions aligned with product and business goals.<br>Mentored engineers through reviews, guidance, and technical support.<br>Improved reliability with monitoring, automated recovery, and proactive issue prevention.<br><b>Impact:</b> mentored a team of engineers, and delivered (4+) client integrations with excellence.",
  
    "lumenalta-dataEngineer-description": "Maintained and optimized ETL pipelines with Airflow, Databricks, Snowflake, PostgreSQL, Redshift, and AWS.<br>Refactored major parts of the codebase, cutting storage use by 50% and accelerating pipelines.<br>Automated recurring workflows such as emails and reporting.<br>Consolidated fragmented ETL processes into a single scalable framework.",
  
    "lumenalta-pythonDeveloper-description": "Developed serverless applications with Chalice, Terraform, and AWS (SNS, SES, DynamoDB).<br>Reverse-engineered SaaS apps to enable new integrations.<br>Integrated external partners into the client platform.",
  
    "lumenalta-javascriptFullstackDeveloper-description": "Built web applications with NodeJS, ReactJS, and MongoDB.<br>Adapted client software to meet accessibility standards (WCAG/ADA).",
  
    "develcode-techLead-description": "Technical leader for an integration project using SpringBoot and ReactJS.<br>Directed architecture, technical decisions, and delivery for a small engineering team.",
  
    "develcode-fullStackDeveloper-description": "Built frontend applications with ReactJS and TypeScript.<br>Developed backend services with Java (SpringBoot) and managed PostgreSQL/MySQL databases.<br>Maintained a native Android app.",
  
    "concordia-fullStackDeveloper-description": "Built platforms including a gym app, membership system (with reservations, users, and payments), industrial maintenance system, and e-commerce dashboards.<br>Owned architecture design (DB schemas, APIs, infrastructure) and migrations from legacy databases (Firebird → PostgreSQL/MySQL).<br>Automated backups and reporting pipelines with Python, Django, and ReactJS.<br>Balanced independent delivery with small-team collaboration (2–4 engineers).<br>Conducted code reviews, mentored junior engineers, and gathered client requirements.<br><b>Impact:</b> Revamped a maintenance system with modern tech, improving usability and client visibility.",
  
    "dipsystem-fullStackDeveloper-description": "Ported a legacy tracking system into a new, modern architecture.<br>Built web apps with Python (Django, Tornado), NodeJS, Angular, MongoDB, and MySQL.<br>Improved performance and data handling for large-scale operational systems.",
  
    "techsExperience": "Here are some of the main technologies I'm experienced with",
    "reachMeOutText": "If you want to talk about career opportunities, discuss about leveling up professionally, or just do some networking, I'm all ears! Don't hesitate to reach out - I'm here to connect, collaborate, and share ideas with like-minded people."
  }
  