{
    "Home": "Home",
    "Career": "Career",
    "Contact": "Contact",
    "Skills": "Skills",
    "Curriculum vitae": "Curriculum vitae",
    "heyText": "Hey, I'm Gabriel.",
    "dramaticPhrase": "I like when things break — because that's when you learn what holds them together.",
    "presentationParagraph": "I'm the kind of person who takes things apart just to see how they work — and sometimes, to figure out why they <i>don't</i>.<br>I love writing code, but what really keeps me engaged is the bigger picture — building with intention and thinking beyond the code, communicating clearly, and making sure everyone on a team knows what they're doing (and <i>why</i>).<br>I believe good engineering is as much about people as it is about tech, and that the best solutions are the ones that actually make someone's day easier.<br>More than anything, I want to keep growing — as an engineer, as a teammate, and as a leader.",
    "curriculumPresentationParagraph": "I'm an engineer who thrives on building systems that make sense — technically and practically. I've worked across frontend, backend and infrastructure, using various tools and technologies to create solid, scalable solutions. To me, good engineering is about more than code — it's about clear thinking, strong collaboration, and solving the right problems. I believe that alignment beats assumptions every time.<br>I'm focused on growing not just as a developer, but as someone who helps teams move with clarity and confidence.",
    
    "techsExperience": "Here are some of the main technologies I'm experienced with",
    "lumenalta-dataEngineer-description": "Maintaining and building ETL pipelines using Airflow, PostgreSQL, Databricks, Snowflake, AWS Redshift, AWS S3, AWS Lambda, and other AWS tools.<br>Refactored nearly the entire project codebase, resulting in substantial improvements.<br>Reduced database storage utilization by up to 50% and dramatically accelerated crucial data pipelines.<br>Streamlined operations by automating and optimizing manual tasks such as email dispatch and report generation.<br>Centralized the client's ETL architecture, consolidating dispersed processes into a single, easily managed framework.",
    
    "lumenalta-pythonDeveloper-description": "Development of serverless applications using Chalice, Terraform, and other AWS technologies (SNS, SES, and DynamoDB).<br>Reverse engineering on web SAAS applications.<br>Integrating new partners into the client platform.",
    "lumenalta-javascriptFullstackDeveloper-description": "Development of web applications using NodeJS, ReactJS and MongoDB.<br>Brief experience with adapting client software to conform with Web Accessibility Guidelines (WCAG/ADA).",
    "develcode-techLead-description": "Technical leader of a project integration development using SpringBoot and ReactJS.",
    "develcode-fullStackDeveloper-description": "Created frontend applications with JavaScript and TypeScript (ReactJS), utilizing HTML and CSS3.<br>Developed backend applications using Java (SpringBoot), along with managing databases in PostgreSQL and MySQL.<br>Conducted maintenance tasks on a native Android mobile app.",
    
    "concordia-fullStackDeveloper-description": "Built web apps using Django (Python), HTML, CSS, JavaScript, and TypeScript, and also dabbled in ReactJS, NodeJS, Angular, and NestJS.<br>Had a hand in making hybrid mobile apps with ReactNative and Ionic Cordova.<br>Recreated a legacy platform by moving it to the web with newer tech, making it more user-friendly.<br>Got good at moving data between different systems and formats for clients.",

    "dipsystem-fullStackDeveloper-description": "Helped to port a legacy tracking system to a new version written from scratch and using newer technology.<br>Worked on web applications using HTML, CSS3, JavaScript and TypeScript, NodeJS, Python (Django, Tornado), MySQL, Angular and MongoDB.",

    "testbox-leadEngineer-description": "Responsible for driving the technical direction of the team, building scalable and reliable solutions, and helping the team deliver with clarity and consistency. I work primarily with Python, AWS, Terraform, and CircleCI to build and maintain backend infrastructure and client-facing integrations.<br>Make architecture and design decisions aligned with product and business goals.<br>Mentoring and supporting engineers through code reviews and technical guidance.<br>Ensuring integrations run smoothly and issues are proactively addressed.",
    
    "reachMeOutText": "If you want to talk about career opportunities, discuss about leveling up professionally, or just do some networking, I'm all ears! Don't hesitate to reach out - I'm here to connect, collaborate, and share ideas with like-minded people.",
    
    "DEPRECATED__lumenalta-dataEngineer-part1": "Maintaining and building ETL pipelines using Airflow, PostgreSQL, Databricks, Snowflake, AWS Redshift, AWS S3, AWS Lambda, and other AWS tools.",
    "DEPRECATED__lumenalta-dataEngineer-part2": "Refactored nearly the entire project codebase, resulting in substantial improvements.",
    "DEPRECATED__lumenalta-dataEngineer-part3": "Reduced database storage utilization by up to 50% and dramatically accelerated crucial data pipelines.",
    "DEPRECATED__lumenalta-dataEngineer-part4": "Streamlined operations by automating and optimizing manual tasks such as email dispatch and report generation.",
    "DEPRECATED__lumenalta-dataEngineer-part5": "Centralized the client's ETL architecture, consolidating dispersed processes into a single, easily managed framework.",
    "DEPRECATED__lumenalta-pythonDeveloper-part1": "Development of serverless applications using Chalice, Terraform, and other AWS technologies (SNS, SES, and DynamoDB).",
    "DEPRECATED__lumenalta-pythonDeveloper-part2": "Reverse engineering on web SAAS applications.",
    "DEPRECATED__lumenalta-pythonDeveloper-part3": "Integrating new partners into the client platform.",
    "DEPRECATED__lumenalta-javascriptFullstackDeveloper-part1": "Development of web applications using NodeJS, ReactJS and MongoDB.",
    "DEPRECATED__lumenalta-javascriptFullstackDeveloper-part2": "Brief experience with adapting client software to conform with Web Accessibility Guidelines (WCAG/ADA).",
    "DEPRECATED_develcode-fullStackDeveloper-part1": "Created frontend applications with JavaScript and TypeScript (ReactJS), utilizing HTML and CSS3.",
    "DEPRECATED_develcode-fullStackDeveloper-part2": "Developed backend applications using Java (SpringBoot), along with managing databases in PostgreSQL and MySQL.",
    "DEPRECATED_develcode-fullStackDeveloper-part3": "Conducted maintenance tasks on a native Android mobile app.",
    "DEPRECATED__concordia-fullStackDeveloper-part1": "Built web apps using Django (Python), HTML, CSS, JavaScript, and TypeScript, and also dabbled in ReactJS, NodeJS, Angular, and NestJS.",
    "DEPRECATED__concordia-fullStackDeveloper-part2": "Had a hand in making hybrid mobile apps with ReactNative and Ionic Cordova.",
    "DEPRECATED__concordia-fullStackDeveloper-part3": "Recreated a legacy platform by moving it to the web with newer tech, making it more user-friendly.",
    "DEPRECATED__concordia-fullStackDeveloper-part4": "Got good at moving data between different systems and formats for clients.",
    "DEPRECATED__dipsystem-fullStackDeveloper-part1": "Helped to port a legacy tracking system to a new version written from scratch and using newer technology.",
    "DEPRECATED__dipsystem-fullStackDeveloper-part2": "Worked on web applications using HTML, CSS3, JavaScript and TypeScript, NodeJS, Python (Django, Tornado), MySQL, Angular and MongoDB."
}