{
    "Home": "Início",
    "Career": "Carreira",
    "My Career": "Minha Carreira",
    "Contact": "Contato",
    "Skills": "Habilidades",
    "Curriculum vitae": "Curriculum vitae",
    "About Me": "Sobre Mim",
    "Print Me": "Imprimir",
    "See more at": "Veja mais em",
  
    "heyText": "Olá, me chamo Gabriel.",
    "dramaticPhrase": "Gosto quando as coisas quebram - porque é aí que você descobre o que realmente as mantém de pé.",
  
    "presentationParagraph": "Sou do tipo que desmonta as coisas só para entender como funcionam - e às vezes, para descobrir por que não funcionam.<br><br>Adoro escrever código, mas o que realmente me prende é o que vai além disso - construir com propósito, pensar além do código, comunicar com clareza e garantir que todo mundo no time saiba o que está fazendo (e por quê).<br><br>Acredito que programação de verdade é tanto sobre pessoas quanto sobre tecnologia - e que as melhores soluções são aquelas que de fato tornam o dia de alguém mais fácil.",
  
    "curriculumPresentationParagraph": "Sou um programador que se realiza construindo sistemas que fazem sentido - tanto do ponto de vista técnico quanto prático. Atuei em frontend, backend e infraestrutura, utilizando diversas ferramentas e tecnologias para criar soluções sólidas e escaláveis. Acredito que uma boa engenharia vai além do código - envolve pensamento claro, colaboração forte e foco nos problemas certos.<br>Estou em constante evolução, não apenas como desenvolvedor, mas como alguém que ajuda times a avançarem com clareza e confiança.",
  
    "testbox-leadEngineer-description": "Líder técnico responsável por direcionar o time de integrações.<br>Construí e escalei infraestrutura de backend em Python e AWS (Terraform, Lambda, CircleCI) para suportar integrações voltadas ao cliente.<br>Realizei decisões de arquitetura e design alinhadas com objetivos de produto e negócio.<br>Mentorei desenvolvedores por meio de revisões, orientação e suporte técnico.<br>Melhorei a confiabilidade com monitoramento, recuperação automatizada e prevenção proativa de falhas.<br><b>Impacto:</b> mentorei um time de desenvolvedores e entreguei (4+) integrações para clientes com excelência.",
  
    "lumenalta-dataEngineer-description": "Mantive e otimizei pipelines ETL com Airflow, Databricks, Snowflake, PostgreSQL, Redshift e AWS.<br>Refatorei partes críticas do código, reduzindo em 50% o uso de armazenamento e acelerando pipelines.<br>Automatizei fluxos recorrentes como disparo de emails e geração de relatórios.<br>Consolidei processos ETL fragmentados em uma arquitetura unificada e escalável.",
  
    "lumenalta-pythonDeveloper-description": "Desenvolvi aplicações serverless com Chalice, Terraform e AWS (SNS, SES, DynamoDB).<br>Fiz engenharia reversa em aplicações SaaS para habilitar novas integrações.<br>Integrei parceiros externos à plataforma do cliente.",
  
    "lumenalta-javascriptFullstackDeveloper-description": "Desenvolvi aplicações web utilizando NodeJS, ReactJS e MongoDB.<br>Adaptei software de cliente para atender padrões de acessibilidade (WCAG/ADA).",
  
    "develcode-techLead-description": "Líder técnico em um projeto de integração utilizando SpringBoot e ReactJS.<br>Dirigi decisões de arquitetura, técnicas e de entrega em um time pequeno de desenvolvimento.",
  
    "develcode-fullStackDeveloper-description": "Criei aplicações frontend com ReactJS e TypeScript.<br>Desenvolvi serviços backend em Java (SpringBoot) e gerenciei bancos de dados PostgreSQL/MySQL.<br>Realizei manutenção em um aplicativo Android nativo.",
  
    "concordia-fullStackDeveloper-description": "Construí plataformas como um app de academia, sistema de associação (com reservas, usuários e pagamentos), sistema de manutenção industrial e dashboards de e-commerce.<br>Projetei arquitetura (modelagem de bancos, APIs, infraestrutura) e liderei migrações de sistemas legados (Firebird → PostgreSQL/MySQL).<br>Automatizei backups e relatórios internos usando Python, Django e ReactJS.<br>Atuei tanto em projetos solo quanto em equipes pequenas (2–4 engenheiros).<br>Realizei code reviews, mentorei colegas e levantei requisitos junto a clientes.<br><b>Impacto:</b> modernizei um sistema de manutenção, trazendo maior usabilidade e visibilidade para operações de clientes.",
  
    "dipsystem-fullStackDeveloper-description": "Portei um sistema de rastreamento legado para uma arquitetura moderna.<br>Desenvolvi aplicações web com Python (Django, Tornado), NodeJS, Angular, MongoDB e MySQL.<br>Melhorei desempenho e manipulação de dados em sistemas operacionais de grande escala.",
  
    "techsExperience": "Aqui estão algumas das principais tecnologias com as quais tenho experiência",
    
    "reachMeOutText": "Se você quiser falar sobre oportunidades de carreira, crescer profissionalmente ou apenas fazer networking, estou à disposição! Não hesite em me chamar - estou aqui para criar conexões, colaborar e trocar ideias com pessoas de mentalidade parecida.",
    "Less than a month": "Há menos de um mês",
    "My Skills": "Minhas Habilidades",
    "Languages & others": "Linguagens & outros",
    "Frameworks & Libs": "Frameworks & bibliotecas",
    "Databases": "Bancos de dados",
    "Other technologies": "Outras tecnologias",
    "January": "Janeiro",
    "February": "Fevereiro",
    "March": "Março",
    "July": "Julho",
    "August": "Agosto",
    "September": "Setembro",
    "the moment": "o momento",
    "month": "mês",
    "months": "meses",
    "year": "ano",
    "years": "anos"
  }
  