{
    "Home": "Início",
    "Career": "Carreira",
    "Contact": "Contato",
    "Skills": "Habilidades",
    "About Me": "Sobre Mim",
    "Curriculum vitae": "Curriculum vitae",
    "Print Me": "Imprimir",
    "See more at": "Veja mais em",
    "heyText": "Olá, eu sou o Gabriel.",
    "dramaticPhrase": "E eu amo ajudar as pessoas através da programação.",
    "presentationParagraph1": "Sou um consultor e engenheiro de dados dedicado que pode ajudar você a alcançar os objetivos da sua empresa.",
    "presentationParagraph2": "Mesmo tendo experiência com soluções em frontend e backend - através da construção de aplicações fullstack - eu repetidamente me vi atraído às curiosidades do desenvolvimento backend.",
    "presentationParagraph3": "Minha maior paixão na tecnologia é trabalhar com dados - extraindo, transformando, e utilizando o potencial de dados das mais variadas fontes em busca de criar valor significativo",
    "My Skills": "Minhas Habilidades",
    "techsExperience": "Aqui estão algumas das tecnologias principais com as quais tenho experiência",
    "Languages & others": "Linguagens & outros",
    "Frameworks & Libs": "Frameworks & bibliotecas",
    "Databases": "Bancos de dados",
    "Other technologies": "Outras tecnologias",
    "My Career": "Minha Carreira",
    "January": "Janeiro",
    "February": "Fevereiro",
    "March": "Março",
    "July": "Julho",
    "August": "Agosto",
    "September": "Setembro",
    "the moment": "o momento",
    "Data engineer": "Engenheiro de dados",
    "lumenalta-dataEngineer-part1": "Manutenção e contrução de pipelines ETL utilizando Airflow, PostgreSQL, Databricks, Snowflake, AWS Redshift, AWS S3, AWS Lambda, e outras ferramentas da AWS.",
    "lumenalta-dataEngineer-part2": "Refatorei praticamente todo o código do projeto, resultando em melhorias consideráveis.",
    "lumenalta-dataEngineer-part3": "Reduzi a utilização de armazenamento do banco de dados em aproximadamente 50% e acelerei a execução de pipelines de dados importantes consideravelmente.",
    "lumenalta-dataEngineer-part4": "Simplifiquei operações através da automação e otimização de tarefas manuais, como envio de emails e geração de relatórios.",
    "lumenalta-dataEngineer-part5": "Centralizei a arquitetura de ETL do cliente, consolidando processos dispersos utilizando um único framework de fácil gerenciamento.",
    "Python developer": "Desenvolvedor python",
    "lumenalta-pythonDeveloper-part1": "Desenvolvimento de aplicações serverless usando Chalice, Terraform, e outras tecnologias da AWS (SNS, SES, e DynamoDB).",
    "lumenalta-pythonDeveloper-part2": "Engenharia reversa em aplicações SAAS.",
    "lumenalta-pythonDeveloper-part3": "Integração de novos parceiros na plataforma do cliente.",
    "JavaScript fullstack developer": "Desenvolvedor javascript fullstack",
    "lumenalta-javascriptFullstackDeveloper-part1": "Desenvolvimento de aplicações web utilizando NodeJS, ReactJS e MongoDB.",
    "lumenalta-javascriptFullstackDeveloper-part2": "Breve experiência adaptando o software do cliente para seguir as regras de acessibilidade da web (Web Accessibility Guidelines - WCAG/ADA).",
    "Tech lead": "Líder técnico",
    "develcode-techLead-part1": "Líder técnico de um projeto de integração utilizando SpringBoot e ReactJS.",
    "Fullstack developer": "Desenvolvedor fullstack",
    "develcode-fullStackDeveloper-part1": "Criei aplicações frontend com JavaScript e TypeScript (ReactJS), utilizando HTML e CSS3.",
    "develcode-fullStackDeveloper-part2": "Desenvolvi aplicações backend utilizando Java (SpringBoot), juntamente com gerenciamento de banco de dados utilizando PostgreSQL e MySQL.",
    "develcode-fullStackDeveloper-part3": "Conduzi tarefas de manutenção em um aplicativo mobile em Android nativo",
    "concordia-fullStackDeveloper-part1": "Construí aplicações web usando Django (Python), HTML, CSS, JavaScript e TypeScript, e também me aventurei com ReactJS, NodeJS, Angular, e NestJS.",
    "concordia-fullStackDeveloper-part2": "Trabalhei brevemente na construção de aplicativos mobile híbridos com ReactNative e Ionic Cordova.",
    "concordia-fullStackDeveloper-part3": "Recriei uma plataforma legado movendo-a para a web com novas tecnologias, e tornando-a mais amigável ao usuário.",
    "concordia-fullStackDeveloper-part4": "Fiquei bom em mover dados entre diferentes sistemas e formatos para nossos clientes.",
    "dipsystem-fullStackDeveloper-part1": "Ajudei a portar um sistema de rastreamento legado para uma nova versão escrita do zero e utilizando tecnologias mais recentes.",
    "dipsystem-fullStackDeveloper-part2": "Trabalhei em aplicações web utilizando HTML, CSS3, JavaScript e TypeScript, NodeJS, Python (Django, Tornado), MySQL, Angular e MongoDB.",
    "Let's Chat": "Vamos Conversar",
    "Reach out to me through social media": "Fale comigo pelas redes sociais",
    "reachMeOutText": "Se você quiser falar sobre oportunidades de carreira, subir de nível profissionalmente, ou apenas fazer um networking, sou todo ouvidos! Não hesite em me chamar - estou aqui para fazer novas conexões, colaborar e trocar ideias com pessoas de pensamento parecido.",
    "Data engineer and Fullstack developer": "Engenheiro de dados e Desenvolvedor fullstack"
}